{"pageProps":{"page":{"id":"cl3rs5fbid5es0bmit08qok7s","title":"About","slug":"about","center":true,"content":{"json":{"children":[{"type":"heading-one","children":[{"text":"About THE TEAM"}]},{"type":"heading-four","children":[{"text":"Pranksy – Founder"}]},{"type":"paragraph","children":[{"text":"Pranksy is a Founder of NFTBOXES Ltd. He’s well-known within the Crypto space, particularly on the Ethereum blockchain. He works carefully with the contributing artists to ensure only the best quality NFTs are included every month. In his spare time, he likes eating spicy enchiladas and watching the Thames go by."}]},{"type":"heading-four","children":[{"text":"Magpie - Founder"}]},{"type":"paragraph","children":[{"text":"Magpie is a Founder of NFTBOXES Ltd. She organises the Company and contributes ideas. When she’s not bossing everybody about, you will find her discovering new treasures and colouring the world with oil pastels."}]},{"type":"heading-four","children":[{"text":"Tom"}]},{"type":"paragraph","children":[{"text":"Tom is a Director of NFTBOXES Ltd. He bonded with Pranksy over terrible singing and nerd culture. He uploads the artwork onto the blockchain and handles some PR work. When he’s not working, he’s building Marvel Lego creations and collecting vintage shirts."}]},{"type":"heading-four","children":[{"text":"Josephine"}]},{"type":"paragraph","children":[{"text":"Josephine is a Director of NFTBOXES Ltd. She is the in-house copywriter at NFTboxes and works with Magpie to contribute new ideas. When she’s not flinging thoughts around, you’ll find her scribbling creatively or devouring a book."}]},{"type":"heading-four","children":[{"text":"The Team Together"}]},{"type":"paragraph","children":[{"text":"We met at a protest in London several years ago and have had plenty of adventures together since. Magpie and Josephine are the magpies, seeking and collecting new treasures, while Pranksy and Tom pick out market trends and manage the technological side. Working closely together is a big part of NFTboxes Ltd, as is having fun. To relax together, we can be seen fighting for people’s rights, hanging art galleries or watching reruns of The Rachel Zoe Project because it’s ‘Bananas’."}]},{"type":"paragraph","children":[{"text":""}]},{"type":"heading-four","children":[{"text":"With Special Thanks to:"}]},{"type":"paragraph","children":[{"text":"Bananakin – Graphics"}]},{"type":"paragraph","children":[{"text":"Owl of Moistness – Smart Contracts and Distribution"}]},{"type":"paragraph","children":[{"text":"NFT42 – Original platform supporters."}]},{"type":"paragraph","children":[{"text":""}]},{"type":"heading-one","children":[{"text":"About NFTBOXES LTD."}]},{"type":"paragraph","children":[{"text":"NFTboxes Ltd. was started in January 2021 by @PranksyNFT and @Carlini8, after the success of Pranksy’s NFT Advent Calendar. When Carlini moved on to new ideas and projects, @MagpieNFT took up co-directorship. NFTboxes bring quality NFT pieces together in a single monthly box from talented artists within the space. Art can be so exciting, but the art world can be closed and talent often gets pushed out of the spotlight. We aim to break that boundary and bring inspiring art pieces to NFT collectors and beyond."}]}]}}}},"__N_SSG":true}